app/views/devise/registrations/new.html.erb

<td><%= f.label :Programing_language,"Select Language" %></td>
<td> <%=f.collection_select :subject_id, Subject.all , :id, :subject, :include_blank => false  %></td>
---
SELECT `subjects`.* FROM `subjects`