app/controllers/quiz_controller.rb

  def index

  if current_user.result.nil?
total = 3
@id = current_user.subject_id
 all = Question.where(subject_id: @id)
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`subject_id` = 2

  def question


	 @current = session[:current]
	 @total   = session[:total]
	 if @current >= @total
		redirect_to :action => "submitresult"
		return
	 end

	 @question = Question.find(session[:questions][@current])
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1

  def answer
	 @current = session[:current]
	 @total   = session[:total]

	 choiceid = params[:choice]

	 @question = session[:question]
	 @choices  = session[:choices]
	 UserAnswer.create(:question_id=>session[:question].id,:choice_id=>choiceid)
	 @choice = choiceid ? Choice.find(choiceid) : nil
	 if @choice and @choice.correct
		@correct = true
		session[:correct] += 1
	 else
		@correct = false
	 end
   puts "=======iam in answer time inspect ==========="
puts params[:time].inspect
    current_user.time=params[:time]
    current_user.save
---
INSERT INTO `user_answers` (`choice_id`, `exam_id`, `question_id`, `result_id`) VALUES (1, NULL, 1, NULL)
SELECT `choices`.* FROM `choices` WHERE `choices`.`id` = 1 LIMIT 1
UPDATE `users` SET `time` = 593, `updated_at` = '2013-11-14 11:27:18' WHERE `users`.`id` = 2

  def submitresult
  	puts "//////////////////hi//////////////////////////////"
  	time_taken = 180 - current_user.time.to_i
    if (current_user.result).nil?
    @addresult = Result.new
     @correct = session[:correct]
    @addresult.score=@correct
  @total   = session[:total]
    @addresult.user_id = current_user.id
    @addresult.first_name = current_user.first_name
    @addresult.email = current_user.email
    @addresult.time = time_taken
    @addresult.save
---
SELECT `results`.* FROM `results` WHERE `results`.`user_id` = 2 LIMIT 1
INSERT INTO `results` (`email`, `question_id`, `score`, `time`, `user_id`, `user_time`) VALUES ('veeru@gmail.com', NULL, 3, NULL, 2, NULL)